# Unknown Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoJoinFailures..::..Unknown Property
BuiltInFailures..::..AutoJoinFailures Class See Also
---
Unknown
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Unknown { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Unknown As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Unknown {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoJoinFailures Class
Autodesk.Revit.DB Namespace